export default function JoinTerms() {
  return (
    <div className="flex flex-col gap-4 sm:gap-8">
      <h1 className="font-bold text-3xl">เงื่อนไขการเข้าร่วมโปรแกรม RianArai Insider</h1>
      <ol className="list-inside list-check leading-8">
        <li>เป็นศิษย์ปัจจุบันของโรงเรียนมัธยมสาธิตวัดพระศรีมหาธาตุ มหาวิทยาลัยราชภัฎพระนคร</li>
        <li>สามารถเข้าสู่ระบบและใช้งานอีเมล PNRU ของทางโรงเรียนได้</li>
        <li>
          มีอุปกรณ์ที่พร้อมทดสอบอย่างน้อย 1 เครื่อง (PC/Android/iOS) และสามารถติดตั้งแอพพลิเคชั่นได้
        </li>
        <li>มีเครือข่ายอินเทอร์เน็ตที่เสถียร เนื่องจากอาจมีการอัพเดทอยู่บ่อยครั้ง</li>
        <li>สามารถใช้งานแอพพลิเคชั่น LINE และฟีเจอร์ OpenChat ได้</li>
        <li>
          แอพพลิเคชันรุ่บเบต้าอาจเกิดปัญหาและข้อผิดพลาดต่าง ๆ หากพบปัญหา
          กรุณาแจ้งภายในกลุ่มเพื่อดำเนินการแก้ไข
          หรือสามารถย้อนกลับไปยังเวอร์ชั่นก่อนหน้า/เวอร์ชั่นเว็บไซต์ (2.0) ได้ตลอดเวลา
        </li>
      </ol>
    </div>
  );
}
